In [1]:
# Import modules
import pandas as pd
import numpy as np
import datetime as dt
%matplotlib inline

In [2]:
# Read whale_returns.csv data into DataFrame whl_df
whl_df = pd.read_csv ('Resources/whale_returns.csv')

# Count null values in whl_df
whl_df.isnull()

,Date,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC
0,False,True,True,True,True
1,False,False,False,False,False
2,False,False,False,False,False
3,False,False,False,False,False
4,False,False,False,False,False
...,...,...,...,...,...
1055,False,False,False,False,False
1056,False,False,False,False,False
1057,False,False,False,False,False
1058,False,False,False,False,False
1059,False,False,False,False,False

In [3]:
# Drop null values in whl_df
whl_df.dropna()

,Date,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC
1,2015-03-03,-0.001266,-0.004981,-0.000496,-0.006569
2,2015-03-04,0.002230,0.003241,-0.002534,0.004213
3,2015-03-05,0.004016,0.004076,0.002355,0.006726
4,2015-03-06,-0.007905,-0.003574,-0.008481,-0.013098
5,2015-03-09,0.000582,0.004225,0.005843,-0.001652
...,...,...,...,...,...
1055,2019-04-25,-0.000285,-0.001291,-0.005153,0.004848
1056,2019-04-26,0.008149,0.009162,0.012355,0.010434
1057,2019-04-29,0.001254,0.002719,0.006251,0.005223
1058,2019-04-30,-0.001295,-0.002211,-0.000259,-0.003702
1059,2019-05-01,-0.005847,-0.001341,-0.007936,-0.007833

In [4]:
# Sort the values of whl_df by 'Date' column in ascending order
whl_df.sort_values(by=['Date'],inplace=True)
whl_df

,Date,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC
0,2015-03-02,NaN,NaN,NaN,NaN
1,2015-03-03,-0.001266,-0.004981,-0.000496,-0.006569
2,2015-03-04,0.002230,0.003241,-0.002534,0.004213
3,2015-03-05,0.004016,0.004076,0.002355,0.006726
4,2015-03-06,-0.007905,-0.003574,-0.008481,-0.013098
...,...,...,...,...,...
1055,2019-04-25,-0.000285,-0.001291,-0.005153,0.004848
1056,2019-04-26,0.008149,0.009162,0.012355,0.010434
1057,2019-04-29,0.001254,0.002719,0.006251,0.005223
1058,2019-04-30,-0.001295,-0.002211,-0.000259,-0.003702
1059,2019-05-01,-0.005847,-0.001341,-0.007936,-0.007833

In [5]:
# Reset the index of whl_df and drop 'index' column
whl_df.reset_index(inplace=True)
whl_df.drop(columns=['index'], inplace=True)
whl_df

,Date,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC
0,2015-03-02,NaN,NaN,NaN,NaN
1,2015-03-03,-0.001266,-0.004981,-0.000496,-0.006569
2,2015-03-04,0.002230,0.003241,-0.002534,0.004213
3,2015-03-05,0.004016,0.004076,0.002355,0.006726
4,2015-03-06,-0.007905,-0.003574,-0.008481,-0.013098
...,...,...,...,...,...
1055,2019-04-25,-0.000285,-0.001291,-0.005153,0.004848
1056,2019-04-26,0.008149,0.009162,0.012355,0.010434
1057,2019-04-29,0.001254,0.002719,0.006251,0.005223
1058,2019-04-30,-0.001295,-0.002211,-0.000259,-0.003702
1059,2019-05-01,-0.005847,-0.001341,-0.007936,-0.007833

In [6]:
# Read sp500_history.csv into DataFrame sp_df
sp_df = pd.read_csv('Resources/sp500_history.csv')

In [7]:
# Check Data Types in sp_df
sp_df.dtypes

Date     object
Close    object
dtype: object

In [8]:
# Convert sp_df 'Date' column to datetime
sp_df['Date'] = pd.to_datetime(sp_df['Date'])

# Remove '$' from 'Close' column and convert to float
sp_df['Close'] = sp_df['Close'].str.replace('$', '').astype(float)

In [9]:
# Sort the values of sp_df by 'Date' column in ascending order
sp_df.sort_values(by=['Date'],inplace=True)
sp_df

           Date    Close
1648 2012-10-01  1444.49
1647 2012-10-02  1445.75
1646 2012-10-03  1450.99
1645 2012-10-04  1461.40
1644 2012-10-05  1460.93
...         ...      ...
4    2019-04-16  2907.06
3    2019-04-17  2900.45
2    2019-04-18  2905.03
1    2019-04-22  2907.97
0    2019-04-23  2933.68

[1649 rows x 2 columns]

In [10]:
# Reset the index of sp_df and drop 'index' column
sp_df.reset_index(inplace=True)
sp_df.drop(columns=['index'], inplace=True)
sp_df

           Date    Close
0    2012-10-01  1444.49
1    2012-10-02  1445.75
2    2012-10-03  1450.99
3    2012-10-04  1461.40
4    2012-10-05  1460.93
...         ...      ...
1644 2019-04-16  2907.06
1645 2019-04-17  2900.45
1646 2019-04-18  2905.03
1647 2019-04-22  2907.97
1648 2019-04-23  2933.68

[1649 rows x 2 columns]

In [11]:
# Calculate Daily Returns of sp_df
close_px = sp_df['Close']
sp_dly_ret = close_px / close_px.shift(1) - 1

# Append Daily Returns sp_dly_ret to new column in sp_df named 'S&P 500'
sp_df['S&P 500'] = sp_dly_ret

# Drop nulls from sp_df
sp_df.dropna()

# Drop Column 'Close' from sp_df
sp_df.drop(columns=['Close'], inplace=True)
sp_df

           Date   S&P 500
0    2012-10-01       NaN
1    2012-10-02  0.000872
2    2012-10-03  0.003624
3    2012-10-04  0.007174
4    2012-10-05 -0.000322
...         ...       ...
1644 2019-04-16  0.000509
1645 2019-04-17 -0.002274
1646 2019-04-18  0.001579
1647 2019-04-22  0.001012
1648 2019-04-23  0.008841

[1649 rows x 2 columns]

In [12]:
# Read algo_returns.csv data into DataFrame algo_df
algo_df = pd.read_csv('Resources/algo_returns.csv')
algo_df

            Date    Algo 1    Algo 2
0     2014-05-28  0.001745       NaN
1     2014-05-29  0.003978       NaN
2     2014-05-30  0.004464       NaN
3     2014-06-02  0.005692       NaN
4     2014-06-03  0.005292       NaN
...          ...       ...       ...
1236  2019-04-25  0.000682 -0.007247
1237  2019-04-26  0.002981  0.005256
1238  2019-04-29  0.005208  0.002829
1239  2019-04-30 -0.002944 -0.001570
1240  2019-05-01  0.000094 -0.007358

[1241 rows x 3 columns]

In [13]:
# Sort the values of algo_df by 'Date' column in ascending order
algo_df.sort_values(by=['Date'],inplace=True)
algo_df

            Date    Algo 1    Algo 2
0     2014-05-28  0.001745       NaN
1     2014-05-29  0.003978       NaN
2     2014-05-30  0.004464       NaN
3     2014-06-02  0.005692       NaN
4     2014-06-03  0.005292       NaN
...          ...       ...       ...
1236  2019-04-25  0.000682 -0.007247
1237  2019-04-26  0.002981  0.005256
1238  2019-04-29  0.005208  0.002829
1239  2019-04-30 -0.002944 -0.001570
1240  2019-05-01  0.000094 -0.007358

[1241 rows x 3 columns]

In [14]:
# Reset the index of sp_df and drop 'index' column
algo_df.reset_index(inplace=True)
algo_df.drop(columns=['index'], inplace=True)
algo_df

            Date    Algo 1    Algo 2
0     2014-05-28  0.001745       NaN
1     2014-05-29  0.003978       NaN
2     2014-05-30  0.004464       NaN
3     2014-06-02  0.005692       NaN
4     2014-06-03  0.005292       NaN
...          ...       ...       ...
1236  2019-04-25  0.000682 -0.007247
1237  2019-04-26  0.002981  0.005256
1238  2019-04-29  0.005208  0.002829
1239  2019-04-30 -0.002944 -0.001570
1240  2019-05-01  0.000094 -0.007358

[1241 rows x 3 columns]

In [15]:
# Combine Whale, Algorithmic and S&P 500 Returns into single DataFrame
ret_df = pd.concat([whl_df, sp_df, algo_df], axis="columns", join="inner")
ret_df

,Date,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC,Date,S&P 500,Date,Algo 1,Algo 2
0,2015-03-02,NaN,NaN,NaN,NaN,2012-10-01,NaN,2014-05-28,0.001745,NaN
1,2015-03-03,-0.001266,-0.004981,-0.000496,-0.006569,2012-10-02,0.000872,2014-05-29,0.003978,NaN
2,2015-03-04,0.002230,0.003241,-0.002534,0.004213,2012-10-03,0.003624,2014-05-30,0.004464,NaN
3,2015-03-05,0.004016,0.004076,0.002355,0.006726,2012-10-04,0.007174,2014-06-02,0.005692,NaN
4,2015-03-06,-0.007905,-0.003574,-0.008481,-0.013098,2012-10-05,-0.000322,2014-06-03,0.005292,NaN
...,...,...,...,...,...,...,...,...,...,...
1055,2019-04-25,-0.000285,-0.001291,-0.005153,0.004848,2016-12-09,0.005939,2018-08-03,-0.003656,0.002817
1056,2019-04-26,0.008149,0.009162,0.012355,0.010434,2016-12-12,-0.001137,2018-08-06,0.000529,0.000285
1057,2019-04-29,0.001254,0.002719,0.006251,0.005223,2016-12-13,0.006540,2018-08-07,0.000207,-0.001330
1058,2019-04-30,-0.001295,-0.002211,-0.000259,-0.003702,2016-12-14,-0.008117,2018-08-08,0.008429,-0.001812
1059,2019-05-01,-0.005847,-0.001341,-0.007936,-0.007833,2016-12-15,0.003883,2018-08-09,0.003474,0.000550